[
    {
        "src": "/home/YTShorts/src/memes/da090f1adfd48fbbed108be1e4d846143bd75dce_0.jpg",
        "alt": "Christ777Verses",
        "category": "science-tech"
    },
    {
        "src": "/home/YTShorts/src/memes/da9ab97dd654d74f70af44c8663b6d54dd36afeaf9c1d7422565a34a07d5334b_1.jpg",
        "alt": "BISHOPS WONT BLESS COUPLES I Entire Bishops' Conferences Say No I Rome Dispatch 1,553 views 38 min ago ...more Church Militant 319K Nv God destroyed S: and __iorrah. God had reason and Theology to do it. Who are we now to side w sin and compromise our Faith in God, is our reason and Theology superior than God's? We are full of pride to think our reason and Theology is more advanced than God's Many popesplainers are putting lipstick on pigs. They're doing mental gymnastics calling something evil and calling it good. popesplainers are practicing modern day \"Sophistry\" Sophistry Has Roots in Greek Philosophy The original Sophists were ancient Greek teachers of rhetoric and philosophy prominent in the Sth century B.C. In their heyday, these philosophers were considered adroit in their reasoning, but later philosophers (particularly Plato) described them as sham philosophers, out for money and willing to say anything to win an argument. Thus sophist (which comes from Greek sophists, meaning \"wise man\" or \"expert') earned a negative connotation as \"a captious or fallacious reasoner.\" Sophistry is reasoning that seems plausible on a superficial level but is actually unsound, or reasoning that is used to deceive. CONT CONFUSE THE LAMP OF FOR IE UGHT OF THE WORLD Woe into them that call evil goo and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter! WOE TO THOSE WHO CALL EVIL GOOD, AND GOOD EVIL; WHO SUBSTITUTE DARKNESS FOR LIGHT, AND LIGHT FOR DARKNESS; WHO SUBSTITUTE BITTER FOR SWEET AND SWEET FOR BITTER! - ISAIAH FOR HE GUARD THE LIVES OF HIS FAITHFUL ONES AND DELIVERS THEM FROM THE HAND OF THE WICKED. PSALM AS Father Seraphim Rose: How to recognise the Antichrist Kralperri - views 1 year ago Isaiah Woe unto them that call evil good, and good evil: that pu darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter!",
        "category": "science-tech"
    },
    {
        "src": "/home/YTShorts/src/memes/3f20bfd1d158398df2ea5f0c2487cb1156394873f1e10fdba271b50d084cfcb7_1.jpg",
        "alt": "ROME DISPATCH Entire Bishops' Conferences Say No I Rome Dispatch 1,553 views 38 min ago ...more Church Militant 319k Nv God destroyed S: and __iorrah. God had reason and Theology to do it. Who are we now to side w sin and compromise our Faith in God, is our reason and Theology superior than God's? We are full of pride to think our reason and Theology is more advanced than God's Many popesplainers are putting lipstick on pigs. They're doing mental gymnastics calling something evil and calling it good. popesplainers are practicing modern day \"Sophistry\" Sophistry Has Roots in Greek Philosophy The original Sophists were ancient Greek teachers of rhetoric and philosophy prominent in the Sth century B.C. In their heyday, these philosophers were considered adroit in their reasoning, but later philosophers (particularly Plato) described them as sham philosophers, out for money and willing to say anything to win an argument. Thus sophist (which comes from Greek sophists, meaning \"wise man\" or \"expert\") earned a negative connotation as \"a captious or fallacious reasoner.\" Sophistry is reasoning that seems plausible on a superficial level but is actually unsound, or reasoning that is used to deceive. DON'T CONFUSE THE LAMP OF DARKNESS FOR IE UGHT OF THE WORLD Woe unto them that call evil good, and good evil; that put darkness for light, and light for darkness; that put bitter for sweet, and sweet for bitter! WOE TO THOSE WHO CALL EVIL GOOD, AND GOOD EVIL; WHO SUBSTITUTE DARKNESS FOR LIGHT, AND LIGHT FOR DARKNESS; WHO SUBSTITUTE ITTER FOR SWEET AND SWEET FOR BITTER! - ISAIAH FOR HE GUARD THE LIVES OF HIS FAITHFUL ONES AND DELIVERS THEM FROM THE HAND OF THE WICKED. PSALM AS Woeunto them Father Seraphim Rose: How to recognise the Antichrist Kralperri - views 1 year ago Men are often eal intelligent'wrongly. Intelligent men are are not those who are erudite in the sayings and books of the wise men of old, but those who have an intelligent soul and can discriminate between good and evil. They avoid what is sinful and harms the soul; and With deep gratitude to God they resolutely by adhete by dint of practice to what good i$ good and benefits the soul. These men alone should cruly be called intelligent.\" - St The Great -",
        "category": "science-tech"
    },
    {
        "src": "/home/YTShorts/src/memes/53577a4b877656b4cab6c2368d1bbeedf69404967fa0900137246e93a32259e2_1.jpg",
        "alt": "Saint Anastasius II of Antioch Also known as Anastasius Il the Younger Profile Bishop of Antioch, Syria in 599. Fought simony in his diocese with the support of Pope Gregory the Great. Murdered by a mob during an uprising of Syrian Jews against Emperor Phocas who was trying to force conversions; because he died in anti-Church violence, he is considered a martyr. Born th century Died 609 Saint Glycerius of Nicomedia Memorial 28 December as one of the 20,000 Martyrs of Nicomedia Profile Priest at Nicomedia, Asia Minor (in modern Turkey). Arrested and tortured in the persecutions of Diocletian; he was offered release if he would denounce his faith; he declined. Martyr. tin Died burned at the stake in 303 in Nicomedia, Bithynia (modern Izmit, Turkey) CATHOLIC SAINTS OF THE DAY FOR DECEMBER 21st. HOLY SAINTS PRAY FOR US! - CATHOLIC SAINTS OF THE DAY FOR DECEMBER 21st. HOLY SAINTS PRAY FOR US! ð\u009f\u0099\u008f â\u009d¤ ð\u009f\u0091¼",
        "category": "science-tech"
    },
    {
        "src": "/home/YTShorts/src/memes/a409e1a808c03fb7bf5ef9d055a20bce19ea180b65d47de9610f0e5e8e5a2851_1.jpg",
        "alt": "Saint Themistocles of Lycia Profile Shepherd at Myra, Lycia. Martyred because he would not tell the authorities where Saint Dioscorus was hiding during the persecution of Valerian. Died beheaded in 253 Representation shepherd with iron caltrops nearby Blessed Adrian of Dalmatia Also known as Hadrian Profile Thirteenth century Dominican missionary. Martyred by Muslims along with 27 companions whose names have not come down to us. Died in Dalmatia Blessed Bezela of Goda Profile Mother of Saint Benno of Meissen. Born late 10th century Germany CATHOLIC SAINTS OF THE DAY FOR DECEMBER 21st. HOLY SAINTS PRAY FOR US! - CATHOLIC SAINTS OF THE DAY FOR DECEMBER 21st. HOLY SAINTS PRAY FOR US! ð\u009f\u0099\u008f â\u009d¤ ð\u009f\u0091¼",
        "category": "science-tech"
    },
    {
        "src": "/home/YTShorts/src/memes/98b3913a1a79466e78f5b67d0682dc90c892d867d3d4e93ba77c9c3334057b29_1.jpg",
        "alt": "Did a cosmetic restoration for grandpa's original chainsaw which started his business decades ago. Still working on the fuel tank. - Did a cosmetic restoration for grandpa's original chainsaw which started his business decades ago. Still working on the fuel tank.",
        "category": "science-tech"
    },
    {
        "src": "/home/YTShorts/src/memes/9e35653d5b2b39cea579000a04faf36d02735dcb_0.jpg",
        "alt": "MariiBoops",
        "category": "science-tech"
    }
]